package com.jxdinfo.hussar.util;

import java.io.FileNotFoundException;
import java.io.PrintStream;
import java.text.SimpleDateFormat;
import java.util.*;

/**
 * @author wenqingkuan
 * @date 2019-10-08 14:15
 */
public class CreateBatchInsertSql {
    /**
     * 山东省冠县身份证代码
     */
    public static final String PROVINCE_SD_GX = "371525";

    public static String sql_pre = "insert into gxsw_payable_info(identity_card,taxpaper_name,taxpayer_item,taxpayer_type,taxpayer_town,taxpayer_village,taxpayer_age) values ('";

    public static String[] towns = {"冠城镇","贾镇","桑阿镇","柳林镇","清水镇","东古城镇","北馆陶镇","斜店乡","梁堂乡","定远寨乡","辛集乡","范寨乡","甘官屯乡","兰沃乡","店子乡","烟庄乡","万善乡"};
    // 冠县冠城镇
    public static String[] gcz_villages = {"耿儿庄村","三里韩村","代家屯村","直隶村","朱霍三里庄村","前张义堡村","后张义堡村","花留庄村","五里韩村","七里韩村","东三里庄村","吴家村","申尹庄村","曹尹庄村","前谷子头村","孟谷子头村","东谷子头村","田庄村","沙庄村","胡庄村","靖庄村","刘神伯东村","刘神伯西村","安村","杨村","于村","包村","五里铺村","西谷子头村","宋三里庄村","徐三里庄村","东街村","西街村","南街村","北街村","东关村","南关村","元庄村","张尹庄村","东堤固村","王孝村","西提固村","王庄子村","李八里庄村","陈八里庄村","邢八里庄村","崔八里庄村","张八里庄村","高三里庄村","吴村","杜刘村","徐刘村","靖刘村","前董固村","后董固村","唐寺村","孙疃村","铺上村","多庄村","寨里村","前唐固村","后唐固村","西范庄村","马宋店村","郑宋店村","殷宋店村","前旺庄村","后旺庄村","马寨村","李芦村","殷芦村","常芦村","吉固村","北头村","朱王芦村","吕庄村"};
    // 冠县贾镇
    public static String[] jz_villages = {"贾镇街村","田茉莉营村","宁茉莉营村","王田村","史谈二寨村","吕田村","许谈二寨村","周庄村","宫庄村","司庞庄村","石家村","后二十里铺村","前二十里铺村","崔庞庄村","李榆林头村","岑庄村","东庄村","荆楼村","柳洼寨村","高庄铺村","王赵店村","艾寨村","徐辛村","王谈二寨村","丁茉莉营村","活佛堂村","许辛村","洼里村","王辛村","葛辛村","陆辛村","许家村","丁庄村","迟宠庄村","堤下庄村","于榆林头村","张榆林头村","庞田村","相里村","杨马庄村","仁二庄村","西庄村","西赵店村","东赵店村","花果屯村"};
    // 冠县桑阿镇
    public static String[] sez_villages = {"桑阿镇街村","野场村","谢家海村","潘庄村","梁庄村","轧庄村","凤庄村","段菜庄村","李菜庄村","任菜庄村","袁菜庄村","杜庄村","魏辛庄村","掖庄村","油坊村","郭家村","潘家村","贾庄村","大张庄村","小张庄村","段庄村","白佛头村","东吕庄村","西吕庄前街村","西吕庄中街村","西吕庄后街村","玉庄村","东朵庄村","西朵庄村","小花园头村","大花园头村","苇园村","小尹庄村","陈贯庄村","范家村","南街村","贾六庄村","北街村","西街村","西白塔村","前李赵庄村","后李赵庄村","王六庄村","侯六庄村","杨赵庄村","程赵庄村","杜赵庄村","东周堡村","西周堡村","杨胡疃村","郭胡疃村","苏胡疃村","胡胡疃村","郝胡疃村","桑桥村","程村","槐木园村","申小屯村","岳庄村","务头村"};
    // 冠县柳林镇
    public static String[] llz_villages = {"大杨庄村","南街村","西街村","东街村","北街村","夫仁寨村","单庄村","西杨庄村","高杨村","孙杨村","李杨村","陈杨村","刘杨村","前和寨村","后和寨村","岳刘庄村","张凡庄村","王凡庄村","南菜园村","油坊村","乔庄村","崔庄村","杜庄村","倪屯村","三里屯村","郭庄村","武庄村","元造户村","娄庄村","邵庄村","李庄村","张四台村","东菜园村","老君堂村","东吴庄村","梁庄村","苟庄村","邓庄村","三合庄村","张四古庄村","乔庙村","西梨元头村","靳万庄村","吴海子村","邢庄村","大梨元头村","东路堂村","大桑村","后路堂村","大界牌村"};
    // 冠县清水镇
    public static String[] qsz_villages = {"南街村","北街村","中街村","蒋寨前村","蒋寨后村","西汪村","王行村","西汪村","卢行村","刘屯村","前东汪村","后东汪村","崔庄村","范家庄村","郭家庄村","前要庄村","后要庄村","小郭寨杜行村","小郭寨许东村","小郭寨许西村","小郭寨姚行村","小郭寨冯东村","小郭寨冯西村","柳行头村","小郭寨邢行村","前小庄村","后小庄村","前井寨村","汤村","锡华前村","锡华后村","闫村","文村","东焦庄村","后井寨村"};
    // 冠县东古城镇
    public static String[] dgcz_villages = {"翟庄村","南赵庄村","南辛庄村","温家庄村","东么庄村","北么庄村","北刘庄村","后辛庄村","南李庄村","北徐庄村","古城南村","东馆陶村","后郑疃村","陈井村","年庄村","前郑疃村","古城北村","南么庄村","西王庄村","东王庄村","栾庄村","牛庄村","南童庄村","杨庄村","焦圈村","四合村","吕庄村","西薛庄村","东徐庄村","焦庄村","路庄村","李草村","李才村","田马园村","王马园村","胡马园村","宁草村","温马园村","王草村","么安堤村","郭安堤村","称钩湾村","王安堤村","后刘庄村","董安堤村","前刘庄村","廖安堤村","乜村","尹固南村","尹固北村","平村","张查村","尹固中村","马庄村","克宁村","铺尚村","西召村","薛圈村","田坡村","郭刘庄村","后杨庄村","王庄村","后邵村","东杨召村","西杨召村","前杨召村","公曹村","宋庄村","童庄村","曲庄村","后田庄村","前田庄村","张庄村","西木提村","前邵村","李圈村","程庄村","罗头村","井庄村","东木堤村","吝庄村"};
    // 冠县北馆陶镇
    public static String[] bgtz_villages = {"西街村","北街村","东关村","东街村","南关村","西关村","小郭庄村","代庄村","乔庄村","学门口村","南刘庄村","南宗庄村","宗屯村","成庄村","何庄村","郎庄村","后纸房村","沃头村","冀庄村","四合村","胡屯村","耿屯村","东沟塞村","肖城村","东门口村","东宋庄村","西宋庄村","许庄村","东柴庄村","西柴庄村","前纸房村","邢庄村","庄村","孙沟塞村","沟塞村","西沟塞村","李元村","小庄村","丁庄村","崔庄村","张庄村","北刘庄村","大刘庄村","米庄村","孟庄村","北宗庄村","闫庄村","位庄村","大郭庄村","林庄村","欧庄村","杜庄村","王屯村"};
    // 冠县斜店乡
    public static String[] xdx_villages = {"斜店二支部村","斜店一支部村","斜店三支部村","南史村","王史村","东张史村","西张史村","赵屯村","吕屯村","庞屯村","辛屯村","南盘前村","东野庄村","西野庄村","施庄铺村","汤庄西村","汤庄东村","汤庄北村","郭庄村","南马寨村","辛庄村","樊楼村","南满菜村","北满菜村","班庄村","张盘村","许盘东村","许盘后村","许盘西村","前社庄村","后社庄村","孙庄村","南盘后村","十里铺村"};
    // 冠县梁堂乡
    public static String[] ltx_villages = {"赵梁堂村","李梁堂村","曹里村","张里村","邹六庄村","东里村","西里村","菜庄集村","田里村","邵村","前辛庄村","北寺地村","刘寺地村","杨寺地村","安庄村","北皇城村","前何仲村","后何仲村","杜黄城村","胡史村","王庄村","高庄村","常菜庄村","于林头村","陈菜庄村","许菜庄村","要庄村","胡闫村","沙闫村","申闫村","姬闫村","康寺地村","杨黄城村","王黄城村"};
    // 冠县定远寨乡
    public static String[] dyzx_villages = {"闫营村","许马王朝营村","定远寨村","前杏园村","后杏园村","毛庄村","李海子村","王海子村","黑周村","白周村","高家村","候家村","三奶奶庙村","义和庄村","任洼村","千户营村","金郭庄村","银郭庄村","闫袁庄村","吕铺村","北杨庄村","魏庄村","郭关庙村","南杨庄村","张洼村","黄寨子村","范王庄村","张桂村","赵桂村","薛闫二庄村","丁闫二庄村","张大闫二庄村","小闫二庄村","秦闫二庄村","石薛王朝营村","栾付桂村","呼家村","双庙村"};
    // 冠县辛集乡
    public static String[] xjx_villages ={"辛集村","前张官屯村","后张官屯村","白官屯村","边庄村","野屋村","柴庄村","邱庄村","杨洼村","西孟庄村","大王庄村","五岔路村","东康八寨村","西康八寨村","董庄村","冯杜庄村","西骆驼山村","东骆驼山村","穆庄村","兴太集村","小夫人寨村","大夫人寨村","赵庄村","李刘八寨村","贾庄村","尹村","邹村","火烧营村","闫二庄村","饮马庄村","王刘八寨村","丁刘八寨村","崔刘八寨村","元虎寨村","于村","史庄村","草镇村","鲍庄村","洼刘村","西合庄村","石槽村","肖集村","王胡同村","齐庄村","员庄村","三合庄村","花园村","军盘寨村","王庄村","岳胡庄村","洼陈村"};
    // 冠县范寨乡
    public static String[] fzx_villages ={"范寨村","大纸坊头村","西纸坊头村","近古寨村","梁罗庄村","刘国庄村","沙王庄村","芦贯庄村","贾贯庄村","宋小屯村","马楼村","马庄村","雷庄村","宗堂村","林庄村","东辛庄村","东邢庄村","小井村","关王庙村","莫王庙村","王韩庄村","隋庄村","张韩庄村","陈韩庄村","陈楼庄村","西邢庄村","祁家务村","孔里庄村","赵里庄村","胡里庄村","戴里庄村","张坊村","范庄村","温庄村","宁辛庄村","小王信村"};
    // 冠县甘官屯乡
    public static String[] ggtx_villages ={"甘官屯村","侣庄村","赵郎寨村","岳庄村","张官寨村","东国寨村","西国寨村","梁村","前王二庄村","后王二庄村","前蚕姑庙村","后蚕姑庙村","大辛庄村","卢辛庄村","梅二庄村","东布寨村","中布寨村","西布寨村","东王信村","西王信村","前王二寨村","后王二寨村","刘贯庄村","连寨前村","连寨中村","连寨后村","东杏二庄村","西杏二庄村","许村","张八寨东村","张八寨中村","张八寨西村","邓官屯村","七姓屯村","南野庄村"};
    // 冠县兰沃乡
    public static String[] lwx_villages ={"大曲村","贾曲村","王曲村","大焦庄村","小焦庄村","田寨村","曲屯村","张保管村","东张庄村","西张庄村","韩路村","石家寨村","赵柳邵村","大柳邵村","前王羡村","中王羡村","后王羡村","大兰沃村","东兰沃村","蔡庄村","朱庄村","张柳邵村","邢柳邵村","郭柳邵村","柳柳邵村","张连子村","段连子村","王连子村"};
    // 冠县店子乡
    public static String[] dzx_villages ={"店子村","高庄子村","东化村","西化村","东孔村","西孔村","赵固村","王当铺村","董当铺村","靖当铺村","大近村","东村","大近村","西村","赵当铺村","石头村","李张固村","赵庄村","小近村","刘张固村","郭张固村","野马庄村","里固九甲村","姚张固村","曲张固东村","曲张固西村","张张固村","李寨村","里固七甲村","里固八甲村"};
    // 冠县烟庄乡
    public static String[] yzx_villages ={"烟庄村","张家庄村","东贾庄村","西贾庄村","东宋村","东范庄村","义村","野庄村","东南庄村","均庄子村","前小化村","后小化村","前十里铺村","后十里铺村","七里佛堂村","马玉村","梁辛庄村","刘辛庄村","庞辛庄村","赵辛庄村","东十里营村","西十里营村","前张平东村","前张平中村","前张平西村","后张平村","西宋村","赵村","王村","王马庄村","陈辛庄村","五岔路村","东开河头村","西开河头村"};
    // 冠县万善乡
    public static String[] wsx_villages ={	"大万善村","宋村","前万善村","万善屯村","葫芦营村","段辛庄村","西北召村","刘召村","东北召村","东召村","召村","铺村","西元坊村","东元坊村","前元坊村","西贾村","东贾村","王王段村","孝子哭村","崔王段村","前庄子村","张王段村","马王段村","南王段村","南马固村","东马固村","西马固村","后马固村","前田平村","后田平村","北田平村","水赞村","高王段村"};

    public static Map<String,String[]> villagesMap = new HashMap();

    static{
        villagesMap.put("冠城镇",gcz_villages);
        villagesMap.put("贾镇",jz_villages);
        villagesMap.put("桑阿镇",sez_villages);
        villagesMap.put("柳林镇",llz_villages);
        villagesMap.put("清水镇",qsz_villages);
        villagesMap.put("东古城镇",dgcz_villages);
        villagesMap.put("北馆陶镇",bgtz_villages);
        villagesMap.put("斜店乡",xdx_villages);
        villagesMap.put("梁堂乡",ltx_villages);
        villagesMap.put("定远寨乡",dyzx_villages);
        villagesMap.put("辛集乡",xjx_villages);
        villagesMap.put("范寨乡",fzx_villages);
        villagesMap.put("甘官屯乡",ggtx_villages);
        villagesMap.put("兰沃乡",lwx_villages);
        villagesMap.put("店子乡",dzx_villages);
        villagesMap.put("烟庄乡",yzx_villages);
        villagesMap.put("万善乡",wsx_villages);
    }
    public static void main(String[] args) throws FileNotFoundException {
        PrintStream ps=new PrintStream("d:/logs.sql");
        System.setOut(ps);
        int count = 200000;
        for(int i=1;i<count;i++){
            String randomID = getRandomID();
            String name  = getName();
            String town = randomOne(towns);
            String[] villages = villagesMap.get(town);
            String village = randomOne(villages);
            System.out.println(sql_pre+randomID+"','"+name+"','城乡居民基本养老保险费','普通农民','"+town+"','"+village+"','18');");
        }
    }

    /**
     * 获取随机生成的身份证号码
     * @author wenqingkuan
     * @return
     */
    public static String getRandomID() {
        String id = "420222199204179999";
        // 随机生成出生年月
        String birth = randomBirth(18, 60);
        // 随机生成顺序号
        String no = new Random().nextInt(899) + 100+"";
        // 随机生成校验码
        String[] checks = { "0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
                "X" };
        String check = randomOne(checks);
        // 拼接身份证号码
        id = PROVINCE_SD_GX + birth + no + check;
        return id;
    }

    /**
     * @author wenqingkuan
     * @param s
     * @return String
     */
    public static String randomOne(String[] s) {
        return s[new Random().nextInt(s.length - 1)];
    }

    /**
     * 随机生成minAge到maxAge年龄段的人的生日日期
     *
     * @author wenqingkuan
     * @param minAge
     * @param maxAge
     * @return String
     */
    public static String randomBirth(int minAge, int maxAge) {
        // 设置日期格式
        SimpleDateFormat dft = new SimpleDateFormat("yyyyMMdd");
        Calendar date = Calendar.getInstance();
        // 设置当前日期
        date.setTime(new Date());
        // 随机设置日期为前maxAge年到前minAge年的任意一天
        int randomDay = 365 * minAge
                + new Random().nextInt(365 * (maxAge - minAge));
        date.set(Calendar.DATE, date.get(Calendar.DATE) - randomDay);
        return dft.format(date.getTime());
    }

    /**
     * 随机生成姓名
     * @return
     */
    public static String getName() {
        Random random = new Random();
        String[] Surname = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
                "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎",
                "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷",
                "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和",
                "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", "熊", "纪", "舒",
                "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闵", "席", "季"};
        String girl = "秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣" +
                "婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽 ";
        String boy = "伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛昌成康星光天达安岩中茂进林有坚和彪" +
                "博诚先敬震振壮会思群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾楠榕风航弘";
        int index = random.nextInt(Surname.length - 1);
        //获得一个随机的姓氏
        String name = Surname[index];
        //可以根据这个数设置产生的男女比例
        int i = random.nextInt(3);
        if(i==2){
            int j = random.nextInt(girl.length()-2);
            if (j % 2 == 0) {
                name = name + girl.substring(j, j + 2);
            } else {
                name = name + girl.substring(j, j + 1);
            }

        }
        else{
            int j = random.nextInt(girl.length()-2);
            if (j % 2 == 0) {
                name = name + boy.substring(j, j + 2);
            } else {
                name = name + boy.substring(j, j + 1);
            }

        }

        return name;
    }
}
